{
  "cv": "https://cdn.glitch.global/3874a658-483f-41ac-b439-3b48eab1370f/blakeprall_long.pdf?v=1721805034709",
  "frontPage": {
    "contact": {
      "contactName": "Blake Prall",
      "shortSummary": "Blake is a recent graduate from Boston College with a double major in computer science and neuroscience.",
      "photo": "https://cdn.glitch.global/3874a658-483f-41ac-b439-3b48eab1370f/1.png?v=1721935881214"
    },
    "paragraphs": [
      {
        "title": "Why I Made This Site",
        "content": "This personal website serves as a showcase for my skills and projects as a recent computer science graduate. I created this site to demonstrate my technical abilities, share my work, and provide a platform where visitors can learn more about my achievements and ongoing projects. It's a reflection of my journey in the tech field and a place for me to present my work in a professional format."
      },
      {
        "title": "About This Site",
        "content": "This site was developed using React and Vite for a modern, fast development experience. React Router DOM enables seamless navigation between pages, while dynamic page generation is powered by a JSON file that allows for easy content updates. The website is also designed using grid, allowing for easy reformatting for anyone who may be viewing on a mobile device. Currently hosted on GitHub, the site features a custom logo and integrates Firebase for user signup and login, providing access to view the source code."
      },
      {
        "title": "About Me",
        "content": "Discover my journey and stay updated with my latest endeavors and achievements. On the About Page, you can read about my background as a recent computer science graduate, my story, and what's currently going on in my life. It's a space where I share my personal and professional milestones, providing insight into who I am and what drives me.",
        "link": "/about"
      },
      {
        "title": "Projects",
        "content": "Explore the projects I've worked on through the Projects Page. From developing a mobile game emulator to a deep learning program for synapse detection, an automatic speech-to-text system, and a collaborative budgeting application, my portfolio showcases a variety of technical achievements. Each project reflects my passion for innovation and problem-solving. Currently, my focus is on this personal website, designed to highlight my skills and provide a platform for my work.",
        "link": "/projects"
      },
      {
        "title": "Future Plans for the Site",
        "content": "In the future, I plan to host my personal website locally using a Linux server. This approach will give me more control over the environment and the opportunity to fine-tune performance and security settings. I am considering several hosting frameworks, including Nginx for its high performance and stability, Apache for its versatility and robust feature set, and Docker for containerization, which would allow for easy deployment and scalability. These tools will enable me to maintain a highly efficient and reliable website. By hosting locally, I aim to provide a seamless and professional experience for visitors, eliminating the lack of browser routing on github pages, and further demonstrating my technical expertise and commitment to quality."
      }
    ]
  },
  "about": {
    "photo": "https://cdn.glitch.global/3874a658-483f-41ac-b439-3b48eab1370f/1.png?v=1721935881214",
    "name": "Blake Prall",
    "education": "Boston College - Chestnut Hill, MA",
    "majors": ["Neuroscience B.S.", "Computer Science B.A."],
    "selfSummary": "I am a recent graduate from Boston College with a double major in Computer Science and Neuroscience. Originating from Cottage Grove, Minnesota, my academic journey has been characterized by a passion for exploring the limitless potential of technology. My dual major in neuroscience and computer science reflects my interdisciplinary approach, where I've leveraged computational methods to solve complex problems and drive innovation.<br><br>Throughout my studies, I've developed robust skills in research, problem-solving, and software development, preparing me to thrive in a dynamic software engineering environment. I am eager to contribute my technical expertise and enthusiasm for innovation to your team, delivering impactful solutions and advancing technology to new heights.",
    "moreDetails": [
      {
        "title": "Educational Journey",
        "content": "I pursued a double major in neuroscience and computer science, a challenging yet rewarding path that honed my analytical and technical skills. Balancing my studies with part-time work to cover groceries was tough, but it taught me resilience and time management. Despite the demanding schedule, I remained committed to my education, engaging in various projects and research that deepened my understanding of both fields. My coursework in neuroscience provided me with a solid foundation in understanding complex biological systems, while my computer science studies equipped me with the technical expertise to develop innovative solutions. This unique combination of disciplines has given me a broad perspective and the ability to approach problems from multiple angles."
      },
      {
        "title": "Work Experience",
        "content": "During the summers, I worked in construction, a fast-paced and physically demanding environment. This experience required me to learn quickly and adapt to new challenges on the fly. It significantly improved my communication skills as I collaborated with diverse teams to complete projects efficiently. The hands-on nature of the job also instilled a strong work ethic and problem-solving abilities that I carry with me today. Working in construction taught me the importance of precision and attention to detail, as even small mistakes could have significant consequences. It also provided me with a sense of accomplishment, knowing that my efforts contributed to the creation of tangible structures."
      },
      {
        "title": "Personal Growth",
        "content": "There was a period of uncertainty in my life when I wasn’t sure what career path to pursue, which led me to forgo internships. This phase, however, was crucial for my personal growth. It allowed me to explore different interests and ultimately helped me realize my passion for technology and problem-solving. These experiences have shaped my approach to challenges and my determination to succeed in my chosen field. I learned the value of perseverance and the importance of staying open to new opportunities. This period of self-discovery also taught me to trust my instincts and follow my passions, even when the path ahead is not always clear."
      },
      {
        "title": "Future Aspirations",
        "content": "Looking ahead, I am excited about the possibilities in the tech industry. My goal is to leverage my background in neuroscience and computer science to develop innovative solutions that can make a meaningful impact. I am particularly interested in areas such as artificial intelligence and data science. I am eager to continue learning and growing, and I look forward to contributing to projects that push the boundaries of technology. I am passionate about using technology to solve real-world problems and improve people’s lives. Whether it’s developing new algorithms to analyze complex data or creating applications that enhance user experiences, I am committed to making a positive difference through my work."
      }
    ]
  },
  "news": [
    {
      "title": "Finish New Personal Website",
      "date": "July 2024"
    },
    {
      "title": "Start Developing New Personal Website",
      "date": "July 2024"
    },
    {
      "title": "Start Working on Workout App",
      "date": "July 2024"
    },
    {
      "title": "Graduated from Boston College",
      "date": "May 2024"
    },
    {
      "title": "Start Working for Outlier AI training Math and Coding",
      "date": "Feb 2024"
    },
    {
      "title": "Start Full Stack Budgeting App",
      "date": "Dec 2023"
    },
    {
      "title": "Finish NectR Project",
      "date": "Dec 2023"
    },
    {
      "title": "Finish ASR Project",
      "date": "Dec 2023"
    },
    {
      "title": "Start NectR Project",
      "date": "Dec 2023"
    },
    {
      "title": "Finish Budgeting App",
      "date": "Dec 2023"
    },
    {
      "title": "Start Budgeting App",
      "date": "Nov 2023"
    },
    {
      "title": "Start Automatic Speech Recognition (ASR) Project",
      "date": "Oct 2023"
    },
    {
      "title": "Start Senior Year",
      "date": "Aug 2023"
    },
    {
      "title": "Finish Junior Year",
      "date": "May 2023"
    },
    {
      "title": "Complete Synapse Project",
      "date": "May 2023"
    }
  ],
  "projects": [
    {
      "id": "personal-website",
      "title": "Personal Website Development",
      "type": "text",
      "titleLink": "",
      "titleLinkLabel": "",
      "description": "&emsp;For my portfolio, I developed a comprehensive personal website that serves as a central hub for information about my professional journey in software engineering. This project, which you are currently navigating, showcases my skills in web development and my ability to create dynamic, user-friendly interfaces. The website is built using a robust tech stack that includes TypeScript (TSX), React, Node.js, React Router DOM, Vite, and Firebase. Each of these technologies plays a crucial role in ensuring the site is both functional and efficient. <br> &emsp;One of the standout features of this website is its dynamic content rewriting capability....",
      "descriptionImage": "",
      "contentsImages": [

      ],
      "contents": "&emsp;For my portfolio, I developed a comprehensive personal website that serves as a central hub for information about my professional journey in software engineering. This project, which you are currently navigating, showcases my skills in web development and my ability to create dynamic, user-friendly interfaces. The website is built using a robust tech stack that includes TypeScript (TSX), React, Node.js, React Router DOM, Vite, and Firebase. Each of these technologies plays a crucial role in ensuring the site is both functional and efficient.<br>&emsp;One of the standout features of this website is its dynamic content rewriting capability. This means that the content on the site can be updated in real-time without requiring a full page reload, providing a seamless user experience. Additionally, the website is designed to be fully responsive, automatically adjusting its layout based on the screen size of the device being used. This is achieved through the use of CSS Grid, which allows for flexible and adaptive page layouts. For mobile users, I have implemented an offcanvas navbar that provides easy navigation without taking up valuable screen space.<br>&emsp;The website also includes a powerful global search functionality. This feature allows users to quickly find the information they are looking for by actively showing matches to their search queries and routing them to the relevant pages. The search bar is highly versatile, enabling users to search for specific content on individual pages through a dropdown menu. This ensures that all the information on the site is easily accessible and searchable.<br>&emsp;One of the key aspects of this project is its ease of content management. Almost all the content on the site, including news, projects, about me, the home page, and contact information, can be updated simply by modifying a JSON file. This not only makes the site highly maintainable but also ensures that new data is immediately searchable through the global search bar. This level of flexibility is particularly beneficial for keeping the site up-to-date with minimal effort.<br>&emsp;In terms of security and user authentication, I have integrated Firebase for login functionality. This allows users to securely log in to view the source code and other restricted content. Firebase provides a reliable and scalable solution for managing user authentication, ensuring that only authorized users have access to sensitive information.<br>&emsp;Overall, this personal website project is a testament to my skills in modern web development. It combines a range of advanced features and technologies to create a site that is not only visually appealing but also highly functional and user-friendly. By leveraging tools like React, Node.js, and Firebase, I have been able to build a platform that effectively showcases my professional experience and technical expertise. This project highlights my ability to design and implement complex web applications, making it a valuable addition to my portfolio."
    },
    {
      "id": "budgeting-app",
      "title": "Full Stack Budgeting App",
      "type": "text",
      "titleLink": "https://github.com/leddyd/BudgetApp",
      "titleLinkLabel": "GitHub Repo",
      "description": "&emsp;Introducing <a href=\"https://budgetapp-8ac58.web.app/\" target=\"_blank\">Distant Dollar</a>, a sophisticated budgeting application meticulously crafted by the collaborative efforts of Blake Prall and Dylan Leddy. This groundbreaking financial tool is a testament to the prowess of modern web development, employing a robust technology stack to deliver a seamless and secure budgeting experience. The utilization of React and TypeScript (TSX) ensures a modular and maintainable codebase, while D3 brings dynamic and interactive charts to the forefront, providing users with visually compelling insights into their financial data...",
      "descriptionImage": "https://cdn.glitch.global/3874a658-483f-41ac-b439-3b48eab1370f/distantdollar-Capture1.JPG?v=1721778684432",
      "contentsImages": [

      ],
      "contents": "&emsp;Introducing <a href=\"https://budgetapp-8ac58.web.app/\" target=\"_blank\">Distant Dollar</a>, a sophisticated budgeting application meticulously crafted by the collaborative efforts of Blake Prall and Dylan Leddy. This groundbreaking financial tool is a testament to the prowess of modern web development, employing a robust technology stack to deliver a seamless and secure budgeting experience. The utilization of React and TypeScript (TSX) ensures a modular and maintainable codebase, while D3 brings dynamic and interactive charts to the forefront, providing users with visually compelling insights into their financial data.<br>&emsp;Security is paramount in Distant Dollar, and this is exemplified by the integration of Firebase for user authentication. Users can trust in the app's commitment to safeguarding their financial information, thanks to Firebase's proven authentication mechanisms. Furthermore, Firestore, a NoSQL cloud database, underpins Distant Dollar's data storage and retrieval, ensuring real-time synchronization and accessibility across devices.<br>&emsp;The user-centric design of Distant Dollar sets it apart with an intuitive interface that allows users to effortlessly navigate through the app. Budget tracking becomes a breeze, with users empowered to set budgets for various categories and receive real-time updates on their spending patterns. The application's ability to categorize expenses and provide detailed breakdowns aids in identifying potential savings areas and optimizing financial decisions.<br>&emsp;Blake Prall and Dylan Leddy's commitment to user empowerment is further reflected in Distant Dollar's goal-setting feature. Users can set and pursue financial goals, with the app offering actionable insights to facilitate their journey. As individuals engage with the app's seamless interface, powerful features, and robust security measures, Distant Dollar is poised to redefine the landscape of personal finance management. The collaboration between Prall and Leddy has resulted in a groundbreaking application that stands at the intersection of innovation and financial well-being."
    },
    {
      "id": "asr-project",
      "title": "Automatic Speech Recognition",
      "type": "pdf",
      "titleLink": "https://github.com/bprall/CNN-LSTM-CTC-Automatic-Speech-Recognition",
      "titleLinkLabel": "GitHub Repo",
      "description": "&emsp;In this project, we present a Speech-to-Text model employing a combination of Convolutional Neural Networks (CNNs) and Long Short-Term Memory networks (LSTMs). Trained on the <q>train-clean-100</q> subset of the LIBRISPEECH dataset, our model transforms audio waveforms into spectrograms using MelSpectrogram transformation. To enhance robustness, we apply data augmentation techniques such as frequency masking and time masking. The model's architecture captures both local frequency patterns and temporal dynamics, crucial for accurate speech recognition. We employ the AdamW optimizer and utilize the Connectionist Temporal Classification (CTC) loss function to train our model, addressing challenges associated with variable-length sequences. Evaluation metrics include Character Error Rate (CER) and Word Error Rate (WER). Despite challenges, our model showcases promising performance in automatic speech recognition...</p>",
      "descriptionImage": "https://cdn.glitch.global/3874a658-483f-41ac-b439-3b48eab1370f/Capture.JPG?v=1721782400085",
      "contentsImages": [

      ],
      "contents": "",
      "materials": [
        {
          "label": "paper",
          "path": "https://cdn.glitch.global/3874a658-483f-41ac-b439-3b48eab1370f/Speech_to_Text.pdf?v=1702087574286"
        }
      ]
    },
    {
      "id": "segmentation-project",
      "title": "Synaptic Segmentation via Deep Learning",
      "type": "pdf",
      "titleLink": "https://github.com/bprall/CREMI-Neuron-Cleft-Segmentation",
      "titleLinkLabel": "GitHub Repo",
      "description": "&emsp;I am interested in the idea of mapping the human connectome through the use of deep-learning neural networks. Despite being the system by which we experience the world and the foundation of consciousness, we still know surprisingly little about the central nervous system due to its vast complexity. Connectomics aims to change that by directly mapping these circuits. There are multiple aspects that go into this challenging task, most regarding the segmentation of individual neurons in order to generate a volumetric representation of neural circuitry.<br>&emsp;In my project, I aim to develop a neural network or system of networks that can synaptic clefts. I hypothesize that a U-Net3D-like architecture that predicts 3D bounding boxes of individual neurons from encoder feature maps, which then generates a neuron instance segmentation map through the decoder layers, alongside an FCN that predicts synapses will best complete this task... </p>",
      "descriptionImage": "https://cdn.glitch.global/3874a658-483f-41ac-b439-3b48eab1370f/Capture.JPG?v=1721782203647",
      "contentsImages": [

      ],
      "contents": "",
      "materials": [
        {
          "label": "paper",
          "path": "https://cdn.glitch.global/c6cec155-a368-4ff7-be9e-ab2174e617eb/prallb_final_report.pdf?v=1697601228030"
        }
      ]
    },
    {
      "id": "emulator",
      "title": "Mobile Game Emulator",
      "type": "text",
      "titleLink": "",
      "titleLinkLabel": "",
      "description": "&emsp;Creating a mobile game emulator using a Raspberry Pi was a project I undertook just for fun. The idea of being able to transform a small, affordable computer like the Raspberry Pi into a mobile platform that could play classic games sounded awesome. It was a challenging yet rewarding journey that allowed me to explore my passion for both gaming and tinkering with technology.<br>&emsp;The first step in this endeavor was selecting the right Raspberry Pi model and gathering the necessary components. After some research, I settled on the Raspberry Pi 4 for its improved processing power and versatility. Then, I acquired a high-quality microSD card to store the emulator software and game ROMs and a power supply.<br>&emsp;But I didn't stop there...",
      "descriptionImage": "",
      "contentsImages": [

      ],
      "contents": "&emsp;Creating a mobile game emulator using a Raspberry Pi was a project I undertook just for fun. The idea of being able to transform a small, affordable computer like the Raspberry Pi into a mobile platform that could play classic games sounded awesome. It was a challenging yet rewarding journey that allowed me to explore my passion for both gaming and tinkering with technology.<br>&emsp;The first step in this endeavor was selecting the right Raspberry Pi model and gathering the necessary components. After some research, I settled on the Raspberry Pi 4 for its improved processing power and versatility. Then, I acquired a high-quality microSD card to store the emulator software and game ROMs and a power supply.<br>&emsp;But I didn't stop there; I wanted to take this project to the next level. Inspired by a desire to make the gaming experience more immersive and portable, I decided to 3D print a custom game case. I designed a compact case that perfectly accommodated the Raspberry Pi, microSD card, and power supply. The case was not only functional but also aesthetically pleasing, reminiscent of a handheld gaming device (despite not having on-board controls).<br>&emsp;The real magic happened when I integrated a small LED screen into the design. The LED screen was strategically placed on the top cover of the case, allowing for a visual display of the games. To power the whole setup, I added a set of rechargeable batteries inside the case. The result was a self-contained, portable gaming device, complete with a screen and battery pack.<br>&emsp;Seeing the LED screen light up with the games and feeling the weight of the 3D-printed game case in my hands was a truly gratifying moment. I had transformed a simple Raspberry Pi into a handheld gaming emulator that could be taken anywhere, untethered from power sources. Navigating through game menus, selecting titles, and experiencing the nostalgia of classic games on a self-created device was a unique and immensely satisfying experience.<br>&emsp;In the end, this fun project was a testament to the versatility and creativity that the Raspberry Pi encourages. It allowed me to indulge in my passion for gaming, explore the world of emulation, and discover the potential of a tiny, affordable computer like the Raspberry Pi. It was not just about recreating games; it was about reliving childhood memories and learning new skills along the way. This project stands as a reminder that, in the world of technology and tinkering, even the most whimsical ideas can lead to rewarding and enjoyable experiences, while simultaneously showcasing the power of 3D printing and creative problem-solving."
    }
  ],
  "contact": {
    "address": ["Blaine, MN","address"],
    "phone": ["(651)-808-2645","phone"],
    "email": ["prallb@bc.edu", "email"],
    "github": ["https://www.github.com/bprall", "github.com/bprall"],
    "url": ["https://bprall.github.io","bprall.github.io"],
    "linkedin": ["https://www.linkedin.com/in/bprall/", "linkedin.com/in/bprall"],
    "icons": [
      "https://cdn.glitch.global/c6cec155-a368-4ff7-be9e-ab2174e617eb/542638.png?v=1697597474929",
      "https://cdn.glitch.global/c6cec155-a368-4ff7-be9e-ab2174e617eb/phone-call.svg?v=1697599217973",
      "https://cdn.glitch.global/c6cec155-a368-4ff7-be9e-ab2174e617eb/25231.png?v=1697599252200",
      "https://cdn-icons-png.flaticon.com/512/61/61109.png",
      "https://cdn.glitch.global/c6cec155-a368-4ff7-be9e-ab2174e617eb/6565893.png?v=1697599321046",
      "https://cdn.glitch.global/3874a658-483f-41ac-b439-3b48eab1370f/home-146585_640.webp?v=1721016860188"
    ]
  }
}