{
    "cv": "https://cdn.glitch.global/3874a658-483f-41ac-b439-3b48eab1370f/blakeprall_long.pdf?v=1721344626022",
    "frontPage": [
      {
        "title": "Why I Made This Site",
        "content": "This personal website serves as a showcase for my skills and projects as a recent computer science graduate. I created this site to demonstrate my technical abilities, share my work, and provide a platform where visitors can learn more about my achievements and ongoing projects. It's a reflection of my journey in the tech field and a place for me to present my work in a professional format."
      },
      {
        "title": "About This Site",
        "content": "This site was developed using React and Vite for a modern, fast development experience. React Router DOM enables seamless navigation between pages, while dynamic page generation is powered by a JSON file that allows for easy content updates. Currently hosted on GitHub, the site features a custom logo and integrates Firebase for user signup and login, providing access to view the source code."
      },
      {
        "title": "About Me",
        "content": "Discover my journey and stay updated with my latest endeavors and achievements. On the About Page, you can read about my background as a recent computer science graduate, my story, and what's currently going on in my life. It's a space where I share my personal and professional milestones, providing insight into who I am and what drives me.",
        "link": "/about"
      },
      {
        "title": "Projects",
        "content": "Explore the projects I've worked on through the Projects Page. From developing a mobile game emulator to a deep learning program for synapse detection, an automatic speech-to-text system, and a collaborative budgeting application, my portfolio showcases a variety of technical achievements. Each project reflects my passion for innovation and problem-solving. Currently, my focus is on this personal website, designed to highlight my skills and provide a platform for my work.",
        "link": "/projects"
      },
      {
        "title": "Future Plans for the Site",
        "content": "In the future, I plan to host my personal website locally using a Linux server. This approach will give me more control over the environment and the opportunity to fine-tune performance and security settings. I am considering several hosting frameworks, including Nginx for its high performance and stability, Apache for its versatility and robust feature set, and Docker for containerization, which would allow for easy deployment and scalability. These tools will enable me to maintain a highly efficient and reliable website. By hosting locally, I aim to provide a seamless and professional experience for visitors, further demonstrating my technical expertise and commitment to quality."
      }
    ],
    "about": {
      "photo": "https://cdn.glitch.global/b0561b3a-67fa-44de-99d8-728d82b14013/1701894420208%20(2).jpg?v=1715368201737",
      "name": "Blake Prall",
      "education": "Boston College - Chestnut Hill, MA",
      "majors": ["Neuroscience B.S.", "Computer Science B.A."],
      "selfSummary": "I am a recent graduate from Boston College with a double major in Computer Science and Neuroscience. Originating from Cottage Grove, Minnesota, my academic journey has been characterized by a passion for exploring the limitless potential of technology. My dual major in neuroscience and computer science reflects my interdisciplinary approach, where I've leveraged computational methods to solve complex problems and drive innovation.<br><br>Throughout my studies, I've developed robust skills in research, problem-solving, and software development, preparing me to thrive in a dynamic software engineering environment. I am eager to contribute my technical expertise and enthusiasm for innovation to your team, delivering impactful solutions and advancing technology to new heights.",
      "moreDetails": [
    {
      "title": "Research Experience",
      "content": "During my time at Boston College, I had the opportunity to work on several research projects in both neuroscience and computer science. I collaborated with a team to investigate the neural mechanisms underlying cognitive processes and developed software tools to analyze complex data sets. This experience honed my analytical skills and deepened my understanding of how technology can be applied to solve real-world problems."
    },
    {
      "title": "Personal Projects",
      "content": "In addition to my academic work, I have been involved in various personal projects that showcase my skills and interests. I developed a mobile application aimed at improving mental health through cognitive behavioral therapy techniques, and I also contributed to an open-source project that focuses on enhancing user experience in web applications. These projects have allowed me to apply my knowledge in practical settings and stay current with emerging technologies."
    },
    {
      "title": "Professional Goals",
      "content": "Looking ahead, I am excited to further my career in software engineering, focusing on creating innovative solutions that address complex challenges. I am particularly interested in working on projects that integrate artificial intelligence and machine learning to enhance decision-making processes and drive technological advancements. My goal is to continue growing as a professional while contributing to meaningful projects that make a positive impact on society."
    }
  ]
},
    "news": [
      {
        "title": "Start Developing New Personal Website",
        "date": "July 2024"
      },
      {
        "title": "Start Working on Workout App",
        "date": "July 2024"
      },
      {
        "title": "Graduated from Boston College",
        "date": "May 2024"
      },
      {
        "title": "Start Working for Outlier AI training Math and Coding",
        "date": "Feb 2024"
      },
      {
        "title": "Start Full Stack Budgeting App",
        "date": "Dec 2023"
      },
      {
        "title": "Finish NectR Project",
        "date": "Dec 2023"
      },
      {
        "title": "Finish ASR Project",
        "date": "Dec 2023"
      },
      {
        "title": "Start NectR Project",
        "date": "Dec 2023"
      },
      {
        "title": "Finish Budgeting App",
        "date": "Dec 2023"
      },
      {
        "title": "Start Budgeting App",
        "date": "Nov 2023"
      },
      {
        "title": "Start Automatic Speech Recognition (ASR) Project",
        "date": "Oct 2023"
      },
      {
        "title": "Start Senior Year",
        "date": "Aug 2023"
      },
      {
        "title": "Finish Junior Year",
        "date": "May 2023"
      },
      {
        "title": "Complete Synapse Project",
        "date": "May 2023"
      }
    ],
    "projects": [
      {
        "id": "budgeting-app",
        "title": "Full Stack Budgeting App",
        "type": "text",
        "titleLink": "https://github.com/leddyd/BudgetApp",
        "titleLinkLabel": "GitHub Repo",
        "description": "&emsp;Introducing Distant Dollar, a sophisticated budgeting application meticulously crafted by the collaborative efforts of Blake Prall and Dylan Leddy. This groundbreaking financial tool is a testament to the prowess of modern web development, employing a robust technology stack to deliver a seamless and secure budgeting experience. The utilization of React and TypeScript (TSX) ensures a modular and maintainable codebase, while D3 brings dynamic and interactive charts to the forefront, providing users with visually compelling insights into their financial data...",
        "contents": "&emsp;Introducing Distant Dollar, a sophisticated budgeting application meticulously crafted by the collaborative efforts of Blake Prall and Dylan Leddy. This groundbreaking financial tool is a testament to the prowess of modern web development, employing a robust technology stack to deliver a seamless and secure budgeting experience. The utilization of React and TypeScript (TSX) ensures a modular and maintainable codebase, while D3 brings dynamic and interactive charts to the forefront, providing users with visually compelling insights into their financial data.<br>&emsp;Security is paramount in Distant Dollar, and this is exemplified by the integration of Firebase for user authentication. Users can trust in the app's commitment to safeguarding their financial information, thanks to Firebase's proven authentication mechanisms. Furthermore, Firestore, a NoSQL cloud database, underpins Distant Dollar's data storage and retrieval, ensuring real-time synchronization and accessibility across devices.<br>&emsp;The user-centric design of Distant Dollar sets it apart with an intuitive interface that allows users to effortlessly navigate through the app. Budget tracking becomes a breeze, with users empowered to set budgets for various categories and receive real-time updates on their spending patterns. The application's ability to categorize expenses and provide detailed breakdowns aids in identifying potential savings areas and optimizing financial decisions.<br>&emsp;Blake Prall and Dylan Leddy's commitment to user empowerment is further reflected in Distant Dollar's goal-setting feature. Users can set and pursue financial goals, with the app offering actionable insights to facilitate their journey. As individuals engage with the app's seamless interface, powerful features, and robust security measures, Distant Dollar is poised to redefine the landscape of personal finance management. The collaboration between Prall and Leddy has resulted in a groundbreaking application that stands at the intersection of innovation and financial well-being."
      },
      {
        "id": "asr-project",
        "title": "Automatic Speech Recognition",
        "type": "pdf",
        "titleLink": "https://github.com/bprall/CNN-LSTM-CTC-Automatic-Speech-Recognition",
        "titleLinkLabel": "GitHub Repo",
        "description": "&emsp;In this project, we present a Speech-to-Text model employing a combination of Convolutional Neural Networks (CNNs) and Long Short-Term Memory networks (LSTMs). Trained on the <q>train-clean-100</q> subset of the LIBRISPEECH dataset, our model transforms audio waveforms into spectrograms using MelSpectrogram transformation. To enhance robustness, we apply data augmentation techniques such as frequency masking and time masking. The model's architecture captures both local frequency patterns and temporal dynamics, crucial for accurate speech recognition. We employ the AdamW optimizer and utilize the Connectionist Temporal Classification (CTC) loss function to train our model, addressing challenges associated with variable-length sequences. Evaluation metrics include Character Error Rate (CER) and Word Error Rate (WER). Despite challenges, our model showcases promising performance in automatic speech recognition...</p>",
        "contents": "",
        "materials": [
          {
            "label": "paper",
            "path": "https://cdn.glitch.global/3874a658-483f-41ac-b439-3b48eab1370f/Speech_to_Text.pdf?v=1702087574286"
          }
        ]
      },
      {
        "id": "segmentation-project",
        "title": "Synaptic Segmentation via Deep Learning",
        "type": "pdf",
        "titleLink": "https://github.com/bprall/CREMI-Neuron-Cleft-Segmentation",
        "titleLinkLabel": "GitHub Repo",
        "description": "&emsp;I am interested in the idea of mapping the human connectome through the use of deep-learning neural networks. Despite being the system by which we experience the world and the foundation of consciousness, we still know surprisingly little about the central nervous system due to its vast complexity. Connectomics aims to change that by directly mapping these circuits. There are multiple aspects that go into this challenging task, most regarding the segmentation of individual neurons in order to generate a volumetric representation of neural circuitry.<br>&emsp;In my project, I aim to develop a neural network or system of networks that can synaptic clefts. I hypothesize that a U-Net3D-like architecture that predicts 3D bounding boxes of individual neurons from encoder feature maps, which then generates a neuron instance segmentation map through the decoder layers, alongside an FCN that predicts synapses will best complete this task... </p>",
        "contents": "",
        "materials": [
          {
            "label": "paper",
            "path": "https://cdn.glitch.global/c6cec155-a368-4ff7-be9e-ab2174e617eb/prallb_final_report.pdf?v=1697601228030"
          }
        ]
      },
      {
        "id": "emulator",
        "title": "Mobile Game Emulator",
        "type": "text",
        "titleLink": "",
        "titleLinkLabel": "",
        "description": "&emsp;Creating a mobile game emulator using a Raspberry Pi was a project I undertook just for fun. The idea of being able to transform a small, affordable computer like the Raspberry Pi into a mobile platform that could play classic games sounded awesome. It was a challenging yet rewarding journey that allowed me to explore my passion for both gaming and tinkering with technology.<br>&emsp;The first step in this endeavor was selecting the right Raspberry Pi model and gathering the necessary components. After some research, I settled on the Raspberry Pi 4 for its improved processing power and versatility. Then, I acquired a high-quality microSD card to store the emulator software and game ROMs and a power supply.<br>&emsp;But I didn't stop there...",
        "contents": "&emsp;Creating a mobile game emulator using a Raspberry Pi was a project I undertook just for fun. The idea of being able to transform a small, affordable computer like the Raspberry Pi into a mobile platform that could play classic games sounded awesome. It was a challenging yet rewarding journey that allowed me to explore my passion for both gaming and tinkering with technology.<br>&emsp;The first step in this endeavor was selecting the right Raspberry Pi model and gathering the necessary components. After some research, I settled on the Raspberry Pi 4 for its improved processing power and versatility. Then, I acquired a high-quality microSD card to store the emulator software and game ROMs and a power supply.<br>&emsp;But I didn't stop there; I wanted to take this project to the next level. Inspired by a desire to make the gaming experience more immersive and portable, I decided to 3D print a custom game case. I designed a compact case that perfectly accommodated the Raspberry Pi, microSD card, and power supply. The case was not only functional but also aesthetically pleasing, reminiscent of a handheld gaming device (despite not having on-board controls).<br>&emsp;The real magic happened when I integrated a small LED screen into the design. The LED screen was strategically placed on the top cover of the case, allowing for a visual display of the games. To power the whole setup, I added a set of rechargeable batteries inside the case. The result was a self-contained, portable gaming device, complete with a screen and battery pack.<br>&emsp;Seeing the LED screen light up with the games and feeling the weight of the 3D-printed game case in my hands was a truly gratifying moment. I had transformed a simple Raspberry Pi into a handheld gaming emulator that could be taken anywhere, untethered from power sources. Navigating through game menus, selecting titles, and experiencing the nostalgia of classic games on a self-created device was a unique and immensely satisfying experience.<br>&emsp;In the end, this fun project was a testament to the versatility and creativity that the Raspberry Pi encourages. It allowed me to indulge in my passion for gaming, explore the world of emulation, and discover the potential of a tiny, affordable computer like the Raspberry Pi. It was not just about recreating games; it was about reliving childhood memories and learning new skills along the way. This project stands as a reminder that, in the world of technology and tinkering, even the most whimsical ideas can lead to rewarding and enjoyable experiences, while simultaneously showcasing the power of 3D printing and creative problem-solving."
      }
    ],
    "contact": {
      "address": "Blaine, MN",
      "phone": "(651)-808-2645",
      "email": "prallb@bc.edu",
      "github": ["https://www.github.com/bprall", "github.com/bprall"],
      "url": ["https://bprall.github.io","bprall.github.io"],
      "linkedin": ["https://www.linkedin.com/in/bprall/", "linkedin.com/in/bprall"],
      "icons": [
        "https://cdn.glitch.global/c6cec155-a368-4ff7-be9e-ab2174e617eb/542638.png?v=1697597474929",
        "https://cdn.glitch.global/c6cec155-a368-4ff7-be9e-ab2174e617eb/phone-call.svg?v=1697599217973",
        "https://cdn.glitch.global/c6cec155-a368-4ff7-be9e-ab2174e617eb/25231.png?v=1697599252200",
        "https://cdn-icons-png.flaticon.com/512/61/61109.png",
        "https://cdn.glitch.global/c6cec155-a368-4ff7-be9e-ab2174e617eb/6565893.png?v=1697599321046",
        "https://cdn.glitch.global/3874a658-483f-41ac-b439-3b48eab1370f/home-146585_640.webp?v=1721016860188"
      ]
    }
}